In [2]:
import numpy as np
import time

# Python list
size = 1_000_000
list1 = list(range(size))
list2 = list(range(size))

start = time.time()
result = [x + y for x, y in zip(list1, list2)]
end = time.time()
print("Python list addition time:", end - start)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

2.5381674766540527

In [3]:
# NumPy array
arr1 = np.array(list1)
arr2 = np.array(list2)

start = time.time()
result = arr1 + arr2  # Vectorized operation
end = time.time()
print("NumPy array addition time:", end - start)

[ 0  2  4  6  8 10 12 14 16 18]

0.038062334060668945

In [4]:
num1=np.array([1,2,3,4,5])
num2=np.array([[1,2,3,4],[4,3,2,1]])

# print(type(num1))
# print(num2.shape)

print(num2[0:1,1:3])

[[2 3]]

In [5]:
# print(num1)
# print(num1[::2])

print(np.sum(num2, axis=1))

[10 10]

In [10]:
import pandas as pd 
data ={
"Name":["Nawaira", "Usman", "Laiba", "Mufti Sahab"],
"AI":[10, 98, 99, 89],
"ML":[100, 98, 99, 89],
 "SQL":[10, 98, 99, 89],   
}

df=pd.DataFrame(data, columns=["Name", "AI", "ML", "SQL"])
df

          Name  AI   ML  SQL
0      Nawaira  10  100   10
1        Usman  98   98   98
2        Laiba  99   99   99
3  Mufti Sahab  89   89   89

In [20]:
d=df.melt(id_vars=["Name"],value_vars=["AI", "ML", "SQL"], var_name="Subjects",value_name="Obtained marks")
d.pivot(index="Name", columns="Subjects",values="Obtained marks")

Subjects     AI   ML  SQL
Name
Laiba        99   99   99
Mufti Sahab  89   89   89
Nawaira      10  100   10
Usman        98   98   98

          Name  AI   ML  SQL
0      Nawaira  10  100   10
1        Usman  98   98   98
2        Laiba  99   99   99
3  Mufti Sahab  89   89   89